corelogicminikanren/ProPar-MiniKanren.org
#+SETUPFILE: ./theme-bigblow-local.setup
#+TITLE: Logische Programmierung mit miniKanren
#+SUBTITLE: Programmierparadigmen
#+AUTHOR: Johannes Brauer
#+OPTIONS:   H:4
#+OPTIONS: num:nil d:nil
#+OPTIONS: toc:nil
#+OPTIONS: reveal_single_file:nil
#+Language:  de
#+STARTUP: latexpreview
#+STARTUP: inlineimages
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="mycss/mystyle.css" />
#+REVEAL_THEME: simple
#+REVEAL_TRANS: slide
#+REVEAL_HLEVEL: 1
#+REVEAL_INIT_SCRIPT: dependencies: [ { src: 'plugin/menu/menu.js', async: true },
#+REVEAL_INIT_SCRIPT:                 { src: 'reveal.js/plugin/zoom-js/zoom.js', async: true } ]
#+REVEAL_MARGIN: 0.05
#+REVEAL_EXTRA_CSS: ./mycss/myrevealstyle.css
#+OPTIONS: reveal_control:t

* Grundlagen
+ [[http://minikanren.org][miniKanren]] ist eine domänenspezifische Sprache (DSL) für die
  Einbettung der Logikprogrammierung in verschiedene [[http://minikanren.org/#implementations][Wirtssprachen]].
+ Darunter sind Scheme/Racket, Clojure, Javascript, Java, C#.
+ ursprüngliche Implementierung in Scheme
+ miniKanren kann leicht erweitert werden, z.B. für Constraint Logic
  Programming.
+ Buch: The Reasoned Schemer cite:Friedman2018
* Einführung
** Kernbestandteile der Sprache
+ Die Wirtsprache (hier: Clojure) wird um drei Operationen erweitert:
  + ~==~ für die Unifikation (in Prolog: ~=~)
  + =fresh= für die Deklaration von Variablen (in Prolog:
    Großschreibung von Bezeichnern)
  + =conde= für Fallunterscheidungen
+ Die =run=-Form bildet die Schnittstelle zur Wirtssprache.
+ Die Syntax eines logischen Programms (gemäß der
  core.logic-Bibliothek für Clojure):
  #+BEGIN_SRC clojure
 (run* [logic-variable]
   &logic-expressions)  
  #+END_SRC
+ Die Semantik: Nimm die Menge der logischen Ausdrücke
  (=logic-expressions=), lass sie durch den Löser laufen und gib alle
  Werte von =logic-variable= zurück, die die logischen Ausdrücke erfüllen.
+ Statt =(run* [...] ...)= kann man auch =(run n [...] ...)=
  schreiben, wobei =n= die Anzahl der gewünschten Resultate angibt.
** Elementare Beispiele 
+ Einbindung der [[https://github.com/clojure/core.logic][core.logic-Bibliothek]] ([[https://clojure.github.io/core.logic/#clojure.core.logic.fd/!=][Dokumentation]]), die die Einbettung von
  miniKanren in Clojure bewerkstelligt:
  #+BEGIN_SRC clojure :results results :tangle yes :exports yes
  (use 'clojure.core.logic)
  #+END_SRC

  #+RESULTS:
  : nil

+ ~==~ unifiziert zwei Terme.
+ =fresh= führt lokale Clojure-Variablen ein, die an neue logische
  Variablen gebunden werden.
+ =fresh= führt eine Konjunktion der Relationen in seinem Rumpf aus.
+ Der Ausdruck
  #+BEGIN_SRC clojure :results results :tangle yes :exports yes
  (fresh (x y z) (== x z) (== 3 y))
  #+END_SRC

  #+RESULTS:
  : #function[user/eval9395/fn--9396]

  führte die logischen Variablen =x=, =y= und =z=, und assoziierte =x=
  mit =z= und =y= mit 3. Allerdings ist das kein korrektes miniKanren
  Program. Der Ausdruck muss in die =run=-Form eingerahmt werden:
  #+BEGIN_SRC clojure :results raw :tangle yes :exports yes
  (run 1 (q) (fresh (x y z) (== x z) (== 3 y)))
  #+END_SRC

  #+RESULTS:
  (_0)

  Das Resultat ist eine Liste mit dem Wert =_0=, das ist der
  verdinglichte Wert einer ungebunden Query-Variable =q=.
+ =q= ist auch in dem folgenden Ausdruck ungebunden:
  #+BEGIN_SRC clojure :results raw :tangle yes :exports yes 
  (run 1 (q) (fresh (x y) (== x q) (== 3 y)))  
  #+END_SRC

  #+RESULTS:
  (_0)

+ In den folgenden Ausdrücken wird die Query-Variable durch Unifikation gebunden:
  #+BEGIN_SRC clojure :results raw :tangle yes :exports yes 
  (run 1 (y)
    (fresh (x z)
      (== x z)
      (== 3 y)))
  #+END_SRC

  #+RESULTS:
  (3)

  #+BEGIN_SRC clojure :results raw :tangle yes :exports yes
  (run 1 (q)
    (fresh (x z)
      (== x z)
      (== 3 z)
      (== q x)))
  #+END_SRC

  #+RESULTS:
  (3)

  #+BEGIN_SRC clojure :results raw :tangle yes :exports yes
  (run 1 (y)
    (fresh (x y)
      (== 4 x)
      (== x y))
    (== 3 y))
  #+END_SRC

  #+RESULTS:
  (3)

+ Ein =run= Ausdruck liefert eine Liste mit den Resultaten. Diese kann
  leer sein, wenn der Ausdruck im Rumpf logisch inkonsistent ist.
  #+BEGIN_SRC clojure :results raw :tangle yes :exports yes 
  (run 1 (x) (== x 5) (== x 3))  
  #+END_SRC

  #+RESULTS:
  ()

** Definitionen
+ Ein /logischer Ausdruck/ besteht aus einer Menge von /logischen
  Variablen/ und einer Menge von /Regeln/ (constraints), die die Werte
  der Variablen einschränken.
+ Eine /logische Variable/ (häufig mit /lvar/ abgekürzt) kann
  verschiedene Werte annehmen aber immer nur einen zu einem Zeitpunkt.
+ Beispiel: Das Programm
  #+BEGIN_SRC clojure :results raw :tangle yes :exports yes
  (run* [q]
    (membero q [1 2 3])
    (membero q [2 3 4]))  
  #+END_SRC

  #+RESULTS:
  (2 3)

  kann folgendermaßen gelesen werden: Der Löser soll alle Werte von
  =q= liefern, so dass =q= Element des Vektors [1 2 3] *und* Element
  des Vektors [2 3 4] ist.
