Vorlesung/ProPar-MiniKanren.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="de" xml:lang="de">
<head>
<!-- 2018-09-25 Tue 21:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Logische Programmierung mit miniKanren</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Johannes Brauer" />
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/hideshow.css"/>
<link rel="stylesheet" type="text/css" href="mycss/mystyle.css" />
</head>
<body>
<div id="content">
<h1 class="title">Logische Programmierung mit miniKanren
<br />
<span class="subtitle">Programmierparadigmen</span>
</h1>

<div id="outline-container-org285b51a" class="outline-2">
<h2 id="org285b51a">Grundlagen</h2>
<div class="outline-text-2" id="text-org285b51a">
<ul class="org-ul">
<li><a href="http://minikanren.org">miniKanren</a> ist eine domänenspezifische Sprache (DSL) für die
Einbettung der Logikprogrammierung in verschiedene <a href="http://minikanren.org/#implementations">Wirtssprachen</a>.</li>
<li>Darunter sind Scheme/Racket, Clojure, Javascript, Java, C#.</li>
<li>ursprüngliche Implementierung in Scheme</li>
<li>miniKanren kann leicht erweitert werden, z.B. für Constraint Logic
Programming.</li>
<li>Buch: The Reasoned Schemer <a class='org-ref-reference' href="#Friedman2018">Friedman2018</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgb0127df" class="outline-2">
<h2 id="orgb0127df">Einführung</h2>
<div class="outline-text-2" id="text-orgb0127df">
</div>
<div id="outline-container-org4a0c956" class="outline-3">
<h3 id="org4a0c956">Kernbestandteile der Sprache</h3>
<div class="outline-text-3" id="text-org4a0c956">
<ul class="org-ul">
<li>Die Wirtsprache (hier: Clojure) wird um drei Operationen erweitert:
<ul class="org-ul">
<li><code>==</code> für die Unifikation (in Prolog: <code>=</code>)</li>
<li><code>fresh</code> für die Deklaration von Variablen (in Prolog:
Großschreibung von Bezeichnern)</li>
<li><code>conde</code> für Fallunterscheidungen</li>
</ul></li>
<li>Die <code>run</code>-Form bildet die Schnittstelle zur Wirtssprache.</li>
<li><p>
Die Syntax eines logischen Programms (gemäß der
core.logic-Bibliothek für Clojure):
</p>
<div class="org-src-container">
<pre class="src src-clojure"> <span style="color: #707183;">(</span>run* <span style="color: #7388D6;">[</span>logic-variable<span style="color: #7388D6;">]</span>
   &amp;logic-expressions<span style="color: #707183;">)</span>  
</pre>
</div></li>
<li>Die Semantik: Nimm die Menge der logischen Ausdrücke
(<code>logic-expressions</code>), lass sie durch den Löser laufen und gib alle
Werte von <code>logic-variable</code> zurück, die die logischen Ausdrücke erfüllen.</li>
<li>Statt <code>(run* [...] ...)</code> kann man auch <code>(run n [...] ...)</code>
schreiben, wobei <code>n</code> die Anzahl der gewünschten Resultate angibt.</li>
</ul>
</div>
</div>
<div id="outline-container-orgdb45935" class="outline-3">
<h3 id="orgdb45935">Elementare Beispiele</h3>
<div class="outline-text-3" id="text-orgdb45935">
<ul class="org-ul">
<li><p>
Einbindung der <a href="https://github.com/clojure/core.logic">core.logic-Bibliothek</a> (<a href="https://clojure.github.io/core.logic/#clojure.core.logic.fd/!=">Dokumentation</a>), die die Einbettung von
miniKanren in Clojure bewerkstelligt:
</p>
<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span><span style="color: #006FE0;">use</span> 'clojure.core.logic<span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
nil

</pre></li>

<li><code>==</code> unifiziert zwei Terme.</li>
<li><code>fresh</code> führt lokale Clojure-Variablen ein, die an neue logische
Variablen gebunden werden.</li>
<li><code>fresh</code> führt eine Konjunktion der Relationen in seinem Rumpf aus.</li>
<li><p>
Der Ausdruck
</p>
<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span>fresh <span style="color: #7388D6;">(</span>x y z<span style="color: #7388D6;">)</span> <span style="color: #7388D6;">(</span>== x z<span style="color: #7388D6;">)</span> <span style="color: #7388D6;">(</span>== 3 y<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
#function[user/eval9395/fn--9396]

</pre>

<p>
führte die logischen Variablen <code>x</code>, <code>y</code> und <code>z</code>, und assoziierte <code>x</code>
mit <code>z</code> und <code>y</code> mit 3. Allerdings ist das kein korrektes miniKanren
Program. Der Ausdruck muss in die <code>run</code>-Form eingerahmt werden:
</p>
<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span>run 1 <span style="color: #7388D6;">(</span>q<span style="color: #7388D6;">)</span> <span style="color: #7388D6;">(</span>fresh <span style="color: #909183;">(</span>x y z<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>== x z<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>== 3 y<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
(<sub>0</sub>)
</p>

<p>
Das Resultat ist eine Liste mit dem Wert <code>_0</code>, das ist der
verdinglichte Wert einer ungebunden Query-Variable <code>q</code>.
</p></li>
<li><p>
<code>q</code> ist auch in dem folgenden Ausdruck ungebunden:
</p>
<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span>run 1 <span style="color: #7388D6;">(</span>q<span style="color: #7388D6;">)</span> <span style="color: #7388D6;">(</span>fresh <span style="color: #909183;">(</span>x y<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>== x q<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>== 3 y<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>  
</pre>
</div>

<p>
(<sub>0</sub>)
</p></li>

<li><p>
In den folgenden Ausdrücken wird die Query-Variable durch Unifikation gebunden:
</p>
<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span>run 1 <span style="color: #7388D6;">(</span>y<span style="color: #7388D6;">)</span>
    <span style="color: #7388D6;">(</span>fresh <span style="color: #909183;">(</span>x z<span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>== x z<span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>== 3 y<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
(3)
</p>

<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span>run 1 <span style="color: #7388D6;">(</span>q<span style="color: #7388D6;">)</span>
    <span style="color: #7388D6;">(</span>fresh <span style="color: #909183;">(</span>x z<span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>== x z<span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>== 3 z<span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>== q x<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
(3)
</p>

<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span>run 1 <span style="color: #7388D6;">(</span>y<span style="color: #7388D6;">)</span>
    <span style="color: #7388D6;">(</span>fresh <span style="color: #909183;">(</span>x y<span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>== 4 x<span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>== x y<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
    <span style="color: #7388D6;">(</span>== 3 y<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
(3)
</p></li>

<li><p>
Ein <code>run</code> Ausdruck liefert eine Liste mit den Resultaten. Diese kann
leer sein, wenn der Ausdruck im Rumpf logisch inkonsistent ist.
</p>
<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span>run 1 <span style="color: #7388D6;">(</span>x<span style="color: #7388D6;">)</span> <span style="color: #7388D6;">(</span>== x 5<span style="color: #7388D6;">)</span> <span style="color: #7388D6;">(</span>== x 3<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>  
</pre>
</div>

<p>
()
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org3a6abfe" class="outline-3">
<h3 id="org3a6abfe">Definitionen</h3>
<div class="outline-text-3" id="text-org3a6abfe">
<ul class="org-ul">
<li>Ein <i>logischer Ausdruck</i> besteht aus einer Menge von <i>logischen
Variablen</i> und einer Menge von <i>Regeln</i> (constraints), die die Werte
der Variablen einschränken.</li>
<li>Eine <i>logische Variable</i> (häufig mit <i>lvar</i> abgekürzt) kann
verschiedene Werte annehmen aber immer nur einen zu einem Zeitpunkt.</li>
<li><p>
Beispiel: Das Programm
</p>
<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span>run* <span style="color: #7388D6;">[</span>q<span style="color: #7388D6;">]</span>
    <span style="color: #7388D6;">(</span>membero q <span style="color: #909183;">[</span>1 2 3<span style="color: #909183;">]</span><span style="color: #7388D6;">)</span>
    <span style="color: #7388D6;">(</span>membero q <span style="color: #909183;">[</span>2 3 4<span style="color: #909183;">]</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>  
</pre>
</div>

<p>
(2 3)
</p>

<p>
kann folgendermaßen gelesen werden: Der Löser soll alle Werte von
<code>q</code> liefern, so dass <code>q</code> Element des Vektors [1 2 3] <b>und</b> Element
des Vektors [2 3 4] ist.
</p></li>
</ul>
</div>
