corelogicminikanren/ProPar-MiniKanren.org
*** Namenskonventionen
+ Clojure bietet mit seiner miniKanren-Einbettung core.logic die
  Möglichkeit funktionales und logisches Programmieren miteinander zu verbinden.
+ Um Relationen wie =membero= oder =appendo= von ihren funktionalen
  Pendants äußerlich gut unterscheiden zu können wird an diese häufig
  ein Vokal angehängt.
** Logische Variablen
+ entsprechen weitgehend lokalen Variablen in Clojure: begrenzter
  Gültigkeitsbereich, keine Mutation
+ Der Wert einer logischen Variablen kann undefiniert (oder beliebig)
  sein. Werte dieser Art werden durch die Notation =_N= dargestellt,
  wobei N eine natürliche Zahl ist.
+ Wenn eine lvar einen =_N=-Wert hat, bedeutet das, dass sie einen
  beliebigen Wert annehmen könnte ohne dass die Gültigkeit der Regeln
  verletzt würde.
+ Besitzen zwei lvars die Werte _0 bzw. _1 sind deren Werte beliebig
  und dürfen auch unterschiedlich sein.
+ Besitzen zwei lvars den Wert _0 sind deren Werte beliebig aber
  gleich.
+ Logische Variablen werden auf zwei Arten deklariert:
  + Die Haupt- bzw. Query-Variable wird durch die =run=-Form eingeführt:
    : (run* [query-variable] ...)
    + Ihre (möglichen) Werte bilden das Resultat des =(run* ...)=-Ausdrucks.
    + Es gibt nur eine Hauptvariable.
  + Weitere lvars werden durch die =fresh=-Klausel definiert. Durch
    : (fresh [a b c] &logic-expressions)
    werden drei lvars deklariert, die innerhalb der =logic
    expressions= benutzt werden können.
** Regeln
+ Logische Ausdrücke schränken die Wertebereiche logischer Variablen ein.
+ Alle Ausdrücke innerhalb der =run=-Form werden konjunktiv verknüpft.
+ Der Ausdruck
  #+BEGIN_SRC clojure
  (run* [q]
    (constraint-1)
    (constraint-2)
    (constraint-3))
  #+END_SRC
+ In der Terminologie von miniKanren werden (ähnlich wie in Prolog)
  die einzelnen Terme einer Konjunktion auch als /Ziele/ (goals), die
  erreicht werden (goal succeeds) oder verfehlt werden (goal fails).

  #+BEGIN_SRC clojure :results raw :tangle yes :exports yes
  (run* [v]
    (fresh [q]
    (membero q [1 2 3])
    (membero q [2 3 4])))
  #+END_SRC

  #+RESULTS:
  (_0 _0)

** Die Operatoren
*** =fresh=
siehe oben
*** Die Unifikation: ~==~
+ Der Ausdruck ~(== lvar1 lvar2)~ sorgt dafür, dass die beiden lvars
  die gleiche Menge möglicher Werte besitzen. Das Ziel wird erreicht,
  wenn =lvar1= in Übereinstimmung mit =lvar2= gebracht werden kann.
**** Unifikation einer einzelnen Variablen mit einem Literal
+ Für eine der Variablen kann ein Clojure Literal verwendet werden.
+ Das Ziel in dem Ausdruck
  #+BEGIN_SRC clojure :results raw :tangle yes :exports yes
  (run* [q]
    (== q 1))
  #+END_SRC

  #+RESULTS:
  (1)

  wird erreicht, wenn =q= den Wert 1 annehmen kann. Da =run*= die
  Variable =q= in einem frischen Zustand einführt, ist das
  möglich. Daher ist das Resultat der Auswertung des Ausdrucks (1).
+ Auch Exemplare komplexerer Datentypen können unifiziert werden:
  #+BEGIN_SRC clojure :results raw :tangle yes :exports yes
  (run* [q]
    (== q {:a 1 :b 2}))
  #+END_SRC

  #+RESULTS:
  ({:a 1, :b 2})

  #+BEGIN_SRC clojure :results raw :tangle yes :exports yes
  (run* [q]
    (== {:a q :b 2} {:a 1 :b 2}))
  #+END_SRC

  #+RESULTS:
  (1)

+ Die Reihenfolge der Argumente von ~==~ ist belanglos: Der Ausdruck
  : (run* [q] (== 1 q))
  liefert (1).
**** Unifikation von zwei Variablen
+ Beispiel:
  #+BEGIN_SRC clojure :results raw :tangle yes :exports yes
  (run* [q]
   (fresh [a]
     (membero a [1 2 3])
     (membero q [3 4 5])
     (== a q)))
  #+END_SRC

  #+RESULTS:
  (3)

+ Hier wird mit =fresh= eine neue Variable =a=. Die beiden ersten
  Ziele bestimmen, dass $a\in\{1,2,3\} \land q\in\{3,4,5\}$ gilt. Die
  Unifikation ~(== a q)~ sorgt dafür, dass beide Variablen an die
  Schnittmenge gebunden werden.
**** Die Reihenfolge der Ziele ist irrelevant ...
+ ... bezüglich der Bestimmung des Wertes einer =run=-Form.
+ Die beiden Ausdrücke
  #+BEGIN_SRC clojure :results raw :tangle yes :exports yes
  (run* [q]
   (fresh [a]
     (membero a [1 2 3])
     (membero q [3 4 5])
     (== a q)))
  #+END_SRC
  #+BEGIN_SRC clojure :results raw :tangle yes :exports yes 
  (run* [q]
   (fresh [a]
     (membero a [3 4 5])
     (== q a)
     (membero q [1 2 3])))
  #+END_SRC

  #+RESULTS:
  (3)

  liefern das gleiche Ergebnis: (3).
