Vorlesung/ProPar-MiniKanren.html
<div id="outline-container-orgd29eb8b" class="outline-4">
<h4 id="orgd29eb8b">Namenskonventionen</h4>
<div class="outline-text-4" id="text-orgd29eb8b">
<ul class="org-ul">
<li>Clojure bietet mit seiner miniKanren-Einbettung core.logic die
Möglichkeit funktionales und logisches Programmieren miteinander zu verbinden.</li>
<li>Um Relationen wie <code>membero</code> oder <code>appendo</code> von ihren funktionalen
Pendants äußerlich gut unterscheiden zu können wird an diese häufig
ein Vokal angehängt.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org70378e8" class="outline-3">
<h3 id="org70378e8">Logische Variablen</h3>
<div class="outline-text-3" id="text-org70378e8">
<ul class="org-ul">
<li>entsprechen weitgehend lokalen Variablen in Clojure: begrenzter
Gültigkeitsbereich, keine Mutation</li>
<li>Der Wert einer logischen Variablen kann undefiniert (oder beliebig)
sein. Werte dieser Art werden durch die Notation <code>_N</code> dargestellt,
wobei N eine natürliche Zahl ist.</li>
<li>Wenn eine lvar einen <code>_N</code>-Wert hat, bedeutet das, dass sie einen
beliebigen Wert annehmen könnte ohne dass die Gültigkeit der Regeln
verletzt würde.</li>
<li>Besitzen zwei lvars die Werte _0 bzw. _1 sind deren Werte beliebig
und dürfen auch unterschiedlich sein.</li>
<li>Besitzen zwei lvars den Wert _0 sind deren Werte beliebig aber
gleich.</li>
<li>Logische Variablen werden auf zwei Arten deklariert:
<ul class="org-ul">
<li><p>
Die Haupt- bzw. Query-Variable wird durch die <code>run</code>-Form eingeführt:
</p>
<pre class="example">
(run* [query-variable] ...)

</pre>
<ul class="org-ul">
<li>Ihre (möglichen) Werte bilden das Resultat des <code>(run* ...)</code>-Ausdrucks.</li>
<li>Es gibt nur eine Hauptvariable.</li>
</ul></li>
<li><p>
Weitere lvars werden durch die <code>fresh</code>-Klausel definiert. Durch
</p>
<pre class="example">
(fresh [a b c] &amp;logic-expressions)

</pre>
<p>
werden drei lvars deklariert, die innerhalb der <code>logic
    expressions</code> benutzt werden können.
</p></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org3c8019f" class="outline-3">
<h3 id="org3c8019f">Regeln</h3>
<div class="outline-text-3" id="text-org3c8019f">
<ul class="org-ul">
<li>Logische Ausdrücke schränken die Wertebereiche logischer Variablen ein.</li>
<li>Alle Ausdrücke innerhalb der <code>run</code>-Form werden konjunktiv verknüpft.</li>
<li><p>
Der Ausdruck
</p>
<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span>run* <span style="color: #7388D6;">[</span>q<span style="color: #7388D6;">]</span>
    <span style="color: #7388D6;">(</span>constraint-1<span style="color: #7388D6;">)</span>
    <span style="color: #7388D6;">(</span>constraint-2<span style="color: #7388D6;">)</span>
    <span style="color: #7388D6;">(</span>constraint-3<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div></li>
<li><p>
In der Terminologie von miniKanren werden (ähnlich wie in Prolog)
die einzelnen Terme einer Konjunktion auch als <i>Ziele</i> (goals), die
erreicht werden (goal succeeds) oder verfehlt werden (goal fails).
</p>

<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span>run* <span style="color: #7388D6;">[</span>v<span style="color: #7388D6;">]</span>
    <span style="color: #7388D6;">(</span>fresh <span style="color: #909183;">[</span>q<span style="color: #909183;">]</span>
    <span style="color: #909183;">(</span>membero q <span style="color: #709870;">[</span>1 2 3<span style="color: #709870;">]</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>membero q <span style="color: #709870;">[</span>2 3 4<span style="color: #709870;">]</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
(<sub>0</sub> _0)
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org318bc0d" class="outline-3">
<h3 id="org318bc0d">Die Operatoren</h3>
<div class="outline-text-3" id="text-org318bc0d">
</div>
<div id="outline-container-org85edef3" class="outline-4">
<h4 id="org85edef3"><code>fresh</code></h4>
<div class="outline-text-4" id="text-org85edef3">
<p>
siehe oben
</p>
</div>
</div>
<div id="outline-container-orgb6180dc" class="outline-4">
<h4 id="orgb6180dc">Die Unifikation: <code>==</code></h4>
<div class="outline-text-4" id="text-orgb6180dc">
<ul class="org-ul">
<li>Der Ausdruck <code>(== lvar1 lvar2)</code> sorgt dafür, dass die beiden lvars
die gleiche Menge möglicher Werte besitzen. Das Ziel wird erreicht,
wenn <code>lvar1</code> in Übereinstimmung mit <code>lvar2</code> gebracht werden kann.</li>
</ul>
</div>
<div id="outline-container-org9652136" class="outline-5">
<h5 id="org9652136">Unifikation einer einzelnen Variablen mit einem Literal</h5>
<div class="outline-text-5" id="text-org9652136">
<ul class="org-ul">
<li>Für eine der Variablen kann ein Clojure Literal verwendet werden.</li>
<li><p>
Das Ziel in dem Ausdruck
</p>
<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span>run* <span style="color: #7388D6;">[</span>q<span style="color: #7388D6;">]</span>
    <span style="color: #7388D6;">(</span>== q 1<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
(1)
</p>

<p>
wird erreicht, wenn <code>q</code> den Wert 1 annehmen kann. Da <code>run*</code> die
Variable <code>q</code> in einem frischen Zustand einführt, ist das
möglich. Daher ist das Resultat der Auswertung des Ausdrucks (1).
</p></li>
<li><p>
Auch Exemplare komplexerer Datentypen können unifiziert werden:
</p>
<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span>run* <span style="color: #7388D6;">[</span>q<span style="color: #7388D6;">]</span>
    <span style="color: #7388D6;">(</span>== q <span style="color: #909183;">{</span><span style="color: #D0372D;">:a</span> 1 <span style="color: #D0372D;">:b</span> 2<span style="color: #909183;">}</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
({:a 1, :b 2})
</p>

<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span>run* <span style="color: #7388D6;">[</span>q<span style="color: #7388D6;">]</span>
    <span style="color: #7388D6;">(</span>== <span style="color: #909183;">{</span><span style="color: #D0372D;">:a</span> q <span style="color: #D0372D;">:b</span> 2<span style="color: #909183;">}</span> <span style="color: #909183;">{</span><span style="color: #D0372D;">:a</span> 1 <span style="color: #D0372D;">:b</span> 2<span style="color: #909183;">}</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
(1)
</p></li>

<li><p>
Die Reihenfolge der Argumente von <code>==</code> ist belanglos: Der Ausdruck
</p>
<pre class="example">
(run* [q] (== 1 q))

</pre>
<p>
liefert (1).
</p></li>
</ul>
</div>
</div>
<div id="outline-container-org2bc1193" class="outline-5">
<h5 id="org2bc1193">Unifikation von zwei Variablen</h5>
<div class="outline-text-5" id="text-org2bc1193">
<ul class="org-ul">
<li><p>
Beispiel:
</p>
<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span>run* <span style="color: #7388D6;">[</span>q<span style="color: #7388D6;">]</span>
   <span style="color: #7388D6;">(</span>fresh <span style="color: #909183;">[</span>a<span style="color: #909183;">]</span>
     <span style="color: #909183;">(</span>membero a <span style="color: #709870;">[</span>1 2 3<span style="color: #709870;">]</span><span style="color: #909183;">)</span>
     <span style="color: #909183;">(</span>membero q <span style="color: #709870;">[</span>3 4 5<span style="color: #709870;">]</span><span style="color: #909183;">)</span>
     <span style="color: #909183;">(</span>== a q<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
(3)
</p></li>

<li>Hier wird mit <code>fresh</code> eine neue Variable <code>a</code>. Die beiden ersten
Ziele bestimmen, dass \(a\in\{1,2,3\} \land q\in\{3,4,5\}\) gilt. Die
Unifikation <code>(== a q)</code> sorgt dafür, dass beide Variablen an die
Schnittmenge gebunden werden.</li>
</ul>
</div>
</div>
<div id="outline-container-org84758e1" class="outline-5">
<h5 id="org84758e1">Die Reihenfolge der Ziele ist irrelevant &#x2026;</h5>
<div class="outline-text-5" id="text-org84758e1">
<ul class="org-ul">
<li>&#x2026; bezüglich der Bestimmung des Wertes einer <code>run</code>-Form.</li>
<li><p>
Die beiden Ausdrücke
</p>
<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span>run* <span style="color: #7388D6;">[</span>q<span style="color: #7388D6;">]</span>
   <span style="color: #7388D6;">(</span>fresh <span style="color: #909183;">[</span>a<span style="color: #909183;">]</span>
     <span style="color: #909183;">(</span>membero a <span style="color: #709870;">[</span>1 2 3<span style="color: #709870;">]</span><span style="color: #909183;">)</span>
     <span style="color: #909183;">(</span>membero q <span style="color: #709870;">[</span>3 4 5<span style="color: #709870;">]</span><span style="color: #909183;">)</span>
     <span style="color: #909183;">(</span>== a q<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span>run* <span style="color: #7388D6;">[</span>q<span style="color: #7388D6;">]</span>
   <span style="color: #7388D6;">(</span>fresh <span style="color: #909183;">[</span>a<span style="color: #909183;">]</span>
     <span style="color: #909183;">(</span>membero a <span style="color: #709870;">[</span>3 4 5<span style="color: #709870;">]</span><span style="color: #909183;">)</span>
     <span style="color: #909183;">(</span>== q a<span style="color: #909183;">)</span>
     <span style="color: #909183;">(</span>membero q <span style="color: #709870;">[</span>1 2 3<span style="color: #709870;">]</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
(3)
</p>

<p>
liefern das gleiche Ergebnis: (3).
</p></li>
</ul>
</div>
</div>
</div>
