corelogicminikanren/ProPar-MiniKanren.org
*** =conde=
+ =conde= ermöglicht die disjunktive Verknüpfung von Zielen.
+ Syntax:
  : (conde &clauses)
+ Die Semantik kann durch folgende Analogiebetrachtung erklärt werden:
  #+BEGIN_SRC clojure
  (run* [q]
     (conde
       [goal1 goal2 ...]
       ...))  
  #+END_SRC
  ist vergleichbar mit 
  #+BEGIN_SRC clojure
  (run* [q]
     (OR
       [goal1 AND goal2 AND ...]
       ...))  
  #+END_SRC
**** Beispiele
  #+BEGIN_SRC clojure :results raw :tangle yes :exports yes
  (run* [q]
     (conde
       [succeed]))
  #+END_SRC

  #+RESULTS:
  (_0)

  =succeed= ist immer erfolgreich. =q= kann jeden Wert annehmen.

  #+BEGIN_SRC clojure :results raw :tangle yes :exports yes
  (run* [q]
     (conde
       [succeed succeed succeed]))
  #+END_SRC

  #+RESULTS:
  (_0)

  erfolgreiche Konjunktion, =q= kann jeden Wert annehmen.

  #+BEGIN_SRC clojure :results raw :tangle yes :exports yes
  (run* [q]
     (conde
       [succeed fail succeed]))
  #+END_SRC

  #+RESULTS:
  ()

  nicht erfolgreiche Konjunktion, der Wert für =q= ist ().

  #+BEGIN_SRC clojure :results raw :tangle yes :exports yes
  (run* [q]
     (conde
       [succeed]
       [succeed]))
  #+END_SRC

  #+RESULTS:
  (_0 _0)

  #+BEGIN_SRC clojure :results raw :tangle yes :exports yes
  (run* [q]
     (conde
       [s#]
       [u#]))
  #+END_SRC

  #+RESULTS:
  (_0)

  Jedes Ziel innerhalb einer =conde=-Klausel wird unabhängig
  voneinander erfüllt oder nicht. (=s#= kurz für =succeed=, =u#= kurz
  für =fail=)

  #+BEGIN_SRC clojure :results raw :tangle yes :exports yes
  (run* [q]
     (conde
       [s# (== q 1)]))
  #+END_SRC

  #+RESULTS:
  (1)

  #+BEGIN_SRC clojure :results raw :tangle yes :exports yes
  (run* [q]
     (conde
       [(== q 2) (== q 1)]))
  #+END_SRC

  #+RESULTS:
  ()

  #+BEGIN_SRC clojure :results raw :tangle yes :exports yes
  (run* [q]
     (conde
       [(== q 2)] 
       [(== q 1)]))
  #+END_SRC

  #+RESULTS:
  (2 1)

