Vorlesung/ProPar-MiniKanren.html
<div id="outline-container-org1f1b37e" class="outline-4">
<h4 id="org1f1b37e"><code>conde</code></h4>
<div class="outline-text-4" id="text-org1f1b37e">
<ul class="org-ul">
<li><code>conde</code> ermöglicht die disjunktive Verknüpfung von Zielen.</li>
<li><p>
Syntax:
</p>
<pre class="example">
(conde &amp;clauses)

</pre></li>
<li><p>
Die Semantik kann durch folgende Analogiebetrachtung erklärt werden:
</p>
<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span>run* <span style="color: #7388D6;">[</span>q<span style="color: #7388D6;">]</span>
     <span style="color: #7388D6;">(</span>conde
       <span style="color: #909183;">[</span>goal1 goal2 ...<span style="color: #909183;">]</span>
       ...<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>  
</pre>
</div>
<p>
ist vergleichbar mit 
</p>
<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span>run* <span style="color: #7388D6;">[</span>q<span style="color: #7388D6;">]</span>
     <span style="color: #7388D6;">(</span>OR
       <span style="color: #909183;">[</span>goal1 AND goal2 AND ...<span style="color: #909183;">]</span>
       ...<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>  
</pre>
</div></li>
</ul>
</div>
<div id="outline-container-org96052ea" class="outline-5">
<h5 id="org96052ea">Beispiele</h5>
<div class="outline-text-5" id="text-org96052ea">
<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span>run* <span style="color: #7388D6;">[</span>q<span style="color: #7388D6;">]</span>
     <span style="color: #7388D6;">(</span>conde
       <span style="color: #909183;">[</span>succeed<span style="color: #909183;">]</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
(<sub>0</sub>)
</p>

<p>
<code>succeed</code> ist immer erfolgreich. <code>q</code> kann jeden Wert annehmen.
</p>

<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span>run* <span style="color: #7388D6;">[</span>q<span style="color: #7388D6;">]</span>
     <span style="color: #7388D6;">(</span>conde
       <span style="color: #909183;">[</span>succeed succeed succeed<span style="color: #909183;">]</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
(<sub>0</sub>)
</p>

<p>
erfolgreiche Konjunktion, <code>q</code> kann jeden Wert annehmen.
</p>

<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span>run* <span style="color: #7388D6;">[</span>q<span style="color: #7388D6;">]</span>
     <span style="color: #7388D6;">(</span>conde
       <span style="color: #909183;">[</span>succeed fail succeed<span style="color: #909183;">]</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
()
</p>

<p>
nicht erfolgreiche Konjunktion, der Wert für <code>q</code> ist ().
</p>

<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span>run* <span style="color: #7388D6;">[</span>q<span style="color: #7388D6;">]</span>
     <span style="color: #7388D6;">(</span>conde
       <span style="color: #909183;">[</span>succeed<span style="color: #909183;">]</span>
       <span style="color: #909183;">[</span>succeed<span style="color: #909183;">]</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
(<sub>0</sub> _0)
</p>

<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span>run* <span style="color: #7388D6;">[</span>q<span style="color: #7388D6;">]</span>
     <span style="color: #7388D6;">(</span>conde
       <span style="color: #909183;">[</span>s#<span style="color: #909183;">]</span>
       <span style="color: #909183;">[</span>u#<span style="color: #909183;">]</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
(<sub>0</sub>)
</p>

<p>
Jedes Ziel innerhalb einer <code>conde</code>-Klausel wird unabhängig
voneinander erfüllt oder nicht. (<code>s#</code> kurz für <code>succeed</code>, <code>u#</code> kurz
für <code>fail</code>)
</p>

<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span>run* <span style="color: #7388D6;">[</span>q<span style="color: #7388D6;">]</span>
     <span style="color: #7388D6;">(</span>conde
       <span style="color: #909183;">[</span>s# <span style="color: #709870;">(</span>== q 1<span style="color: #709870;">)</span><span style="color: #909183;">]</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
(1)
</p>

<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span>run* <span style="color: #7388D6;">[</span>q<span style="color: #7388D6;">]</span>
     <span style="color: #7388D6;">(</span>conde
       <span style="color: #909183;">[</span><span style="color: #709870;">(</span>== q 2<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>== q 1<span style="color: #709870;">)</span><span style="color: #909183;">]</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
()
</p>

<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span>run* <span style="color: #7388D6;">[</span>q<span style="color: #7388D6;">]</span>
     <span style="color: #7388D6;">(</span>conde
       <span style="color: #909183;">[</span><span style="color: #709870;">(</span>== q 2<span style="color: #709870;">)</span><span style="color: #909183;">]</span> 
       <span style="color: #909183;">[</span><span style="color: #709870;">(</span>== q 1<span style="color: #709870;">)</span><span style="color: #909183;">]</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
(2 1)
</p>
</div>
</div>
</div>
</div>
