corelogicminikanren/ProPar-MiniKanren.org
** Die „Relationifizierung” einer Funktion

+ Eine klassische Funktion:
  #+BEGIN_SRC clojure :results raw :tangle yes :exports yes 
  (def rember
    (fn [x l]
      (cond
        (empty? l) l
        (= x (first l)) (rest l)
        :else (cons (first l) (rember x (rest l))))))
  (rember 'f '(e f g h i f j k l))
  #+END_SRC
+ Umwandlung in eine Relation (1. Versuch):
  #+BEGIN_SRC clojure :results raw :tangle yes :exports yes 
  (defn rembero1 [x l out]
    (conde
      [(emptyo l)   (== () out)]
      [(firsto l x) (resto l out)]
      [s#           (fresh [a d res]
                      (resto l d)
                      (firsto l a)
                      (conso a res out)
                      (rembero1 x d res))]))
  (run* [q] (rembero1 'f '(e f g h i f j k l) q))
  #+END_SRC

  #+RESULTS:
  #'user/rembero1((e g h i f j k l) (e f g h i j k l) (e f g h i f j k l))

+ Umwandlung in eine Relation (2. Versuch):
  #+BEGIN_SRC clojure :results raw :tangle yes :exports yes 
  (defn rembero1 [x l out]
    (conde
      [(emptyo l)   (== () out)]
      [(firsto l x) (resto l out)]
      [s#           (fresh [a d res]
                      (resto l d)
                      (firsto l a)
                      (conso a res out)
                      (!= a x)
                      ;;;;;;;;
                      (rembero1 x d res))]))
  (run* [q] (rembero1 'f '(e f g h i f j k l) q))
  #+END_SRC

  #+RESULTS:
  #'user/rembero1((e g h i f j k l))

# * Weitere Anwendungen
# siehe [[file:~/Dropbox/Programmierparadigmen/Clojure/logic-tutorial/ProPar-CoreLogicAnwndngn.org][dort]]
* bibliography:referenzen.bib
